app/controllers/user_tickets_controller.rb

SELECT "user_tickets".* FROM "user_tickets"
---
  def index
    @user_tickets = UserTicket.all

INSERT INTO "user_tickets" ("user_id", "ticket_id", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["ticket_id", 1], ["paid", "f"], ["created_at", "2019-05-24 22:32:32.873243"], ["updated_at", "2019-05-24 22:32:32.873243"]]
---
  def create
    @user_ticket = UserTicket.new(user_ticket_params)

    respond_to do |format|
      if @user_ticket.save

UPDATE "user_tickets" SET "paid" = ?, "updated_at" = ? WHERE "user_tickets"."id" = ?  [["paid", "f"], ["updated_at", "2019-05-24 22:48:00.368815"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @user_ticket.update(user_ticket_params)

SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_user_ticket
      @user_ticket = UserTicket.find(params[:id])